In [1]:
import pandas as pd
import numpy as np

In [2]:
# 리스트
display([1, 2, 3], ['a', 'b', 'c'])

[1, 2, 3]

['a', 'b', 'c']

In [3]:
a = [1, 2, 3]
b = [4, 5, 6]

Numpy

In [4]:
np.array(a)

array([1, 2, 3])

In [5]:
np.array([a, b])

array([[1, 2, 3],
       [4, 5, 6]])

Pandas

In [6]:
pd.DataFrame([a, b], columns=['a', 'b', 'c'], index=['X', 'Y'])

   a  b  c
X  1  2  3
Y  4  5  6

In [7]:
pd.Series(a)

0    1
1    2
2    3
dtype: int64

In [8]:
# 데이터 불러오기
df = pd.read_csv("ecommerce.csv")

print(df.shape)
df.head(3)

(500, 8)

,Email,Address,Avatar,Avg. Session Length,Time on App,Time on Website,Length of Membership,Yearly Amount Spent
0,mstephenson@fernandez.com,"835 Frank Tunnel\nWrightmouth, MI 82180-9605",Violet,34.497268,12.655651,39.577668,4.082621,587.951054
1,hduke@hotmail.com,"4547 Archer Common\nDiazchester, CA 06566-8576",DarkGreen,31.926272,11.109461,37.268959,2.664034,392.204933
2,pallen@yahoo.com,"24645 Valerie Unions Suite 582\nCobbborough, D...",Bisque,33.000915,11.330278,37.110597,4.104543,487.547505

In [9]:
# type 확인
display(type(df), type(df['Yearly Amount Spent']))

pandas.core.frame.DataFrame

pandas.core.series.Series

In [10]:
# series를 dataframe으로 변환
pd.DataFrame(df['Yearly Amount Spent'])

     Yearly Amount Spent
0             587.951054
1             392.204933
2             487.547505
3             581.852344
4             599.406092
..                   ...
495           573.847438
496           529.049004
497           551.620145
498           456.469510
499           497.778642

[500 rows x 1 columns]

numpy와 pandas의 상호 호환

In [11]:
pd.DataFrame(np.array([a, b]))

   0  1  2
0  1  2  3
1  4  5  6

In [12]:
np.array(df)

array([['mstephenson@fernandez.com',
        '835 Frank Tunnel\nWrightmouth, MI 82180-9605', 'Violet', ...,
        39.57766801952616, 4.0826206329529615, 587.9510539684005],
       ['hduke@hotmail.com',
        '4547 Archer Common\nDiazchester, CA 06566-8576', 'DarkGreen',
        ..., 37.268958868297744, 2.66403418213262, 392.2049334443264],
       ['pallen@yahoo.com',
        '24645 Valerie Unions Suite 582\nCobbborough, DC 99414-7564',
        'Bisque', ..., 37.110597442120856, 4.104543202376424,
        487.54750486747207],
       ...,
       ['dale88@hotmail.com',
        '0787 Andrews Ranch Apt. 633\nSouth Chadburgh, TN 56128',
        'Cornsilk', ..., 38.33257633196044, 4.958264472618699,
        551.6201454762477],
       ['cwilson@hotmail.com',
        '680 Jennifer Lodge Apt. 808\nBrendachester, TX 05000-5873',
        'Teal', ..., 36.84008572976701, 2.336484668112853,
        456.469510066298],
       ['hannahwilson@davidson.com',
        '49791 Rachel Heights Apt. 898\nEast Drewborough, OR 55919-9528',
        'DarkMagenta', ..., 35.771016191612965, 2.7351595670822757,
        497.7786422156802]], dtype=object)